sebanc/brunch/external-drivers/rtl8723du/core/rtw_pwrctrl.c
// SPDX-License-Identifier: GPL-2.0
/* Copyright(c) 2007 - 2017 Realtek Corporation */

#define _RTW_PWRCTRL_C_

#include <drv_types.h>
#include <hal_data.h>
#include <hal_com_h2c.h>

int rtw_fw_ps_state(struct adapter * adapt)
{
	struct dvobj_priv *psdpriv = adapt->dvobj;
	struct debug_priv *pdbgpriv = &psdpriv->drv_dbg;
	int ret = _FAIL, dont_care = 0;
	u16 fw_ps_state = 0;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);
	struct registry_priv  *registry_par = &adapt->registrypriv;

	if (registry_par->check_fw_ps != 1)
		return _SUCCESS;

	_enter_pwrlock(&pwrpriv->check_32k_lock);

	if (RTW_CANNOT_RUN(adapt)) {
		RTW_INFO("%s: bSurpriseRemoved=%s , hw_init_completed=%d, bDriverStopped=%s\n", __func__
			 , rtw_is_surprise_removed(adapt) ? "True" : "False"
			 , rtw_get_hw_init_completed(adapt)
			 , rtw_is_drv_stopped(adapt) ? "True" : "False");
		goto exit_fw_ps_state;
	}
	rtw_hal_set_hwreg(adapt, HW_VAR_SET_REQ_FW_PS, (u8 *)&dont_care);
	{
		/* 4. if 0x88[7]=1, driver set cmd to leave LPS/IPS. */
		/* Else, hw will keep in active mode. */
		/* debug info: */
		/* 0x88[7] = 32kpermission, */
		/* 0x88[6:0] = current_ps_state */
		/* 0x89[7:0] = last_rpwm */

		rtw_hal_get_hwreg(adapt, HW_VAR_FW_PS_STATE, (u8 *)&fw_ps_state);

		if ((fw_ps_state & 0x80) == 0)
			ret = _SUCCESS;
		else {
			pdbgpriv->dbg_poll_fail_cnt++;
			RTW_INFO("%s: fw_ps_state=%04x\n", __func__, fw_ps_state);
		}
	}


exit_fw_ps_state:
	up(&pwrpriv->check_32k_lock);
	return ret;
}

void _ips_enter(struct adapter *adapt)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);

	pwrpriv->bips_processing = true;

	/* syn ips_mode with request */
	pwrpriv->ips_mode = pwrpriv->ips_mode_req;

	pwrpriv->ips_enter_cnts++;
	RTW_INFO("==>ips_enter cnts:%d\n", pwrpriv->ips_enter_cnts);

	if (rf_off == pwrpriv->change_rfpwrstate) {
		pwrpriv->bpower_saving = true;
		RTW_PRINT("nolinked power save enter\n");

		if (pwrpriv->ips_mode == IPS_LEVEL_2)
			pwrpriv->bkeepfwalive = true;

		pwrpriv->pwr_saving_start_time = rtw_get_current_time();

		rtw_ips_pwr_down(adapt);
		pwrpriv->rf_pwrstate = rf_off;
	}
	pwrpriv->bips_processing = false;

}

void ips_enter(struct adapter *adapt)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);

	rtw_btcoex_IpsNotify(adapt, pwrpriv->ips_mode_req);

	_enter_pwrlock(&pwrpriv->lock);
	_ips_enter(adapt);
	up(&pwrpriv->lock);
}

int _ips_leave(struct adapter *adapt)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);
	int result = _SUCCESS;

	if ((pwrpriv->rf_pwrstate == rf_off) && (!pwrpriv->bips_processing)) {
		pwrpriv->bips_processing = true;
		pwrpriv->change_rfpwrstate = rf_on;
		pwrpriv->ips_leave_cnts++;
		RTW_INFO("==>ips_leave cnts:%d\n", pwrpriv->ips_leave_cnts);

		result = rtw_ips_pwr_up(adapt);
		if (result == _SUCCESS)
			pwrpriv->rf_pwrstate = rf_on;
		
		pwrpriv->pwr_saving_time += rtw_get_passing_time_ms(pwrpriv->pwr_saving_start_time);

		RTW_PRINT("nolinked power save leave\n");

		RTW_INFO("==> ips_leave.....LED(0x%08x)...\n", rtw_read32(adapt, 0x4c));
		pwrpriv->bips_processing = false;

		pwrpriv->bkeepfwalive = false;
		pwrpriv->bpower_saving = false;
	}

	return result;
}

int ips_leave(struct adapter *adapt)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);
	int ret;

	if (!is_primary_adapter(adapt))
		return _SUCCESS;

	_enter_pwrlock(&pwrpriv->lock);
	ret = _ips_leave(adapt);
	up(&pwrpriv->lock);

	if (_SUCCESS == ret)
		odm_dm_reset(&GET_HAL_DATA(adapt)->odmpriv);

	if (_SUCCESS == ret)
		rtw_btcoex_IpsNotify(adapt, IPS_NONE);

	return ret;
}

#ifdef CONFIG_AUTOSUSPEND
	extern void autosuspend_enter(struct adapter *adapt);
	extern int autoresume_enter(struct adapter *adapt);
#endif

#ifdef SUPPORT_HW_RFOFF_DETECTED
	int rtw_hw_suspend(struct adapter *adapt);
	int rtw_hw_resume(struct adapter *adapt);
#endif

static bool rtw_pwr_unassociated_idle(struct adapter *adapter)
{
	u8 i;
	struct adapter *iface;
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);
	struct xmit_priv *pxmit_priv = &adapter->xmitpriv;
	struct mlme_priv *pmlmepriv;
	struct wifidirect_info	*pwdinfo;
	struct cfg80211_wifidirect_info *pcfg80211_wdinfo;
	bool ret = false;

	if (adapter_to_pwrctl(adapter)->bpower_saving) {
		/* RTW_INFO("%s: already in LPS or IPS mode\n", __func__); */
		goto exit;
	}

	if (time_after(adapter_to_pwrctl(adapter)->ips_deny_time, rtw_get_current_time())) {
		/* RTW_INFO("%s ips_deny_time\n", __func__); */
		goto exit;
	}

	for (i = 0; i < dvobj->iface_nums; i++) {
		iface = dvobj->adapters[i];
		if ((iface) && rtw_is_adapter_up(iface)) {
			pmlmepriv = &(iface->mlmepriv);
			pwdinfo = &(iface->wdinfo);
			pcfg80211_wdinfo = &iface->cfg80211_wdinfo;
			if (check_fwstate(pmlmepriv, WIFI_ASOC_STATE | WIFI_SITE_MONITOR)
				|| check_fwstate(pmlmepriv, WIFI_UNDER_LINKING | WIFI_UNDER_WPS)
				|| MLME_IS_AP(iface)
				|| MLME_IS_MESH(iface)
				|| check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE | WIFI_ADHOC_STATE)
				|| rtw_cfg80211_get_is_roch(iface)
				|| rtw_get_passing_time_ms(pcfg80211_wdinfo->last_ro_ch_time) < 3000
			)
				goto exit;

		}
	}

#if (MP_DRIVER == 1)
	if (adapter->registrypriv.mp_mode == 1)
		goto exit;
#endif

	if (pxmit_priv->free_xmitbuf_cnt != NR_XMITBUFF ||
	    pxmit_priv->free_xmit_extbuf_cnt != NR_XMIT_EXTBUFF) {
		RTW_PRINT("There are some pkts to transmit\n");
		RTW_PRINT("free_xmitbuf_cnt: %d, free_xmit_extbuf_cnt: %d\n",
			pxmit_priv->free_xmitbuf_cnt, pxmit_priv->free_xmit_extbuf_cnt);
		goto exit;
	}

	ret = true;

exit:
	return ret;
}


/*
 * ATTENTION:
 *	rtw_ps_processor() doesn't handle LPS.
 */
void rtw_ps_processor(struct adapter *adapt)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);
	struct mlme_priv *pmlmepriv = &(adapt->mlmepriv);
	struct dvobj_priv *psdpriv = adapt->dvobj;
	struct debug_priv *pdbgpriv = &psdpriv->drv_dbg;
#ifdef SUPPORT_HW_RFOFF_DETECTED
	enum rt_rf_power_state rfpwrstate;
#endif /* SUPPORT_HW_RFOFF_DETECTED */
	u32 ps_deny = 0;

	_enter_pwrlock(&adapter_to_pwrctl(adapt)->lock);
	ps_deny = rtw_ps_deny_get(adapt);
	up(&adapter_to_pwrctl(adapt)->lock);
	if (ps_deny != 0) {
		RTW_INFO(FUNC_ADPT_FMT ": ps_deny=0x%08X, skip power save!\n",
			 FUNC_ADPT_ARG(adapt), ps_deny);
		goto exit;
	}

	if (pwrpriv->bInSuspend) { /* system suspend or autosuspend */
		pdbgpriv->dbg_ps_insuspend_cnt++;
		RTW_INFO("%s, pwrpriv->bInSuspend ignore this process\n", __func__);
		return;
	}

