sebanc/brunch/external-drivers/rtl8723du/core/rtw_pwrctrl.c
	pwrpriv->ps_processing = true;

#ifdef SUPPORT_HW_RFOFF_DETECTED
	if (pwrpriv->bips_processing)
		goto exit;

	/* RTW_INFO("==> fw report state(0x%x)\n",rtw_read8(adapt,0x1ca));	 */
	if (pwrpriv->bHWPwrPindetect) {
#ifdef CONFIG_AUTOSUSPEND
		if (adapt->registrypriv.usbss_enable) {
			if (pwrpriv->rf_pwrstate == rf_on) {
				if (adapt->net_closed)
					pwrpriv->ps_flag = true;

				rfpwrstate = RfOnOffDetect(adapt);
				RTW_INFO("@@@@- #1  %s==> rfstate:%s\n", __func__, (rfpwrstate == rf_on) ? "rf_on" : "rf_off");
				if (rfpwrstate != pwrpriv->rf_pwrstate) {
					if (rfpwrstate == rf_off) {
						pwrpriv->change_rfpwrstate = rf_off;

						pwrpriv->bkeepfwalive = true;
						pwrpriv->brfoffbyhw = true;

						autosuspend_enter(adapt);
					}
				}
			}
		} else
#endif /* CONFIG_AUTOSUSPEND */
		{
			rfpwrstate = RfOnOffDetect(adapt);
			RTW_INFO("@@@@- #2  %s==> rfstate:%s\n", __func__, (rfpwrstate == rf_on) ? "rf_on" : "rf_off");

			if (rfpwrstate != pwrpriv->rf_pwrstate) {
				if (rfpwrstate == rf_off) {
					pwrpriv->change_rfpwrstate = rf_off;
					pwrpriv->brfoffbyhw = true;
					rtw_hw_suspend(adapt);
				} else {
					pwrpriv->change_rfpwrstate = rf_on;
					rtw_hw_resume(adapt);
				}
				RTW_INFO("current rf_pwrstate(%s)\n", (pwrpriv->rf_pwrstate == rf_off) ? "rf_off" : "rf_on");
			}
		}
		pwrpriv->pwr_state_check_cnts++;
	}
#endif /* SUPPORT_HW_RFOFF_DETECTED */

	if (pwrpriv->ips_mode_req == IPS_NONE)
		goto exit;

	if (!rtw_pwr_unassociated_idle(adapt))
		goto exit;

	if ((pwrpriv->rf_pwrstate == rf_on) && ((adapt->pwr_state_check_cnts % 4) == 0)) {
		RTW_INFO("==>%s .fw_state(%x)\n", __func__, get_fwstate(pmlmepriv));
#if defined (CONFIG_AUTOSUSPEND)
#else
		pwrpriv->change_rfpwrstate = rf_off;
#endif
#ifdef CONFIG_AUTOSUSPEND
		if (adapt->registrypriv.usbss_enable) {
			if (pwrpriv->bHWPwrPindetect)
				pwrpriv->bkeepfwalive = true;

			if (adapt->net_closed)
				pwrpriv->ps_flag = true;

#if defined (CONFIG_AUTOSUSPEND)
			if (pwrpriv->bInternalAutoSuspend)
				RTW_INFO("<==%s .pwrpriv->bInternalAutoSuspend)(%x)\n", __func__, pwrpriv->bInternalAutoSuspend);
			else {
				pwrpriv->change_rfpwrstate = rf_off;
				RTW_INFO("<==%s .pwrpriv->bInternalAutoSuspend)(%x) call autosuspend_enter\n", __func__, pwrpriv->bInternalAutoSuspend);
				autosuspend_enter(adapt);
			}
#else
			autosuspend_enter(adapt);
#endif	/* if defined (CONFIG_AUTOSUSPEND) */
		} else if (pwrpriv->bHWPwrPindetect) {
		} else
#endif /* CONFIG_AUTOSUSPEND */
		{
#if defined (CONFIG_AUTOSUSPEND)
			pwrpriv->change_rfpwrstate = rf_off;
#endif	/* defined (CONFIG_AUTOSUSPEND) */

			ips_enter(adapt);
		}
	}
exit:
	rtw_set_pwr_state_check_timer(adapt);
	pwrpriv->ps_processing = false;
	return;
}

#if LINUX_VERSION_CODE < KERNEL_VERSION(4, 15, 0)
static void pwr_state_check_handler(void *ctx)
#else
static void pwr_state_check_handler(struct timer_list *t)
#endif
{
#if LINUX_VERSION_CODE < KERNEL_VERSION(4, 15, 0)
	struct adapter *adapt = (struct adapter *)ctx;
#else
	struct adapter *adapt = from_timer(adapt, t, pwr_state_check_timer);
#endif

	rtw_ps_cmd(adapt);
}

void	traffic_check_for_leave_lps(struct adapter * adapt, u8 tx, u32 tx_packets)
{
#ifdef CONFIG_CHECK_LEAVE_LPS
	static unsigned long start_time = 0;
	static u32 xmit_cnt = 0;
	u8	bLeaveLPS = false;
	struct mlme_priv	*pmlmepriv = &adapt->mlmepriv;



	if (tx) { /* from tx */
		xmit_cnt += tx_packets;

		if (start_time == 0)
			start_time = rtw_get_current_time();

		if (rtw_get_passing_time_ms(start_time) > 2000) { /* 2 sec == watch dog timer */
			if (xmit_cnt > 8) {
				if ((adapter_to_pwrctl(adapt)->bLeisurePs) &&
				    (adapter_to_pwrctl(adapt)->pwr_mode != PS_MODE_ACTIVE) &&
				    (!rtw_btcoex_IsBtControlLps(adapt)))
					bLeaveLPS = true;
			}
			start_time = rtw_get_current_time();
			xmit_cnt = 0;
		}
	} else { /* from rx path */
		if (pmlmepriv->LinkDetectInfo.NumRxUnicastOkInPeriod > 4/*2*/) {
			if ((adapter_to_pwrctl(adapt)->bLeisurePs)
			    && (adapter_to_pwrctl(adapt)->pwr_mode != PS_MODE_ACTIVE)
			    && (!rtw_btcoex_IsBtControlLps(adapt))
			   ) {
				bLeaveLPS = true;
			}
		}
	}

	if (bLeaveLPS) {
		/* RTW_INFO("leave lps via %s, Tx = %d, Rx = %d\n", tx?"Tx":"Rx", pmlmepriv->LinkDetectInfo.NumTxOkInPeriod,pmlmepriv->LinkDetectInfo.NumRxUnicastOkInPeriod);	 */
		/* rtw_lps_ctrl_wk_cmd(adapt, LPS_CTRL_LEAVE, 1); */
		rtw_lps_ctrl_wk_cmd(adapt, tx ? LPS_CTRL_TX_TRAFFIC_LEAVE : LPS_CTRL_RX_TRAFFIC_LEAVE, tx ? 0 : 1);
	}
#endif /* CONFIG_CHECK_LEAVE_LPS */
}

/*
 * Description:
 *	This function MUST be called under power lock protect
 *
 * Parameters
 *	adapt
 *	pslv			power state level, only could be PS_STATE_S0 ~ PS_STATE_S4
 *
 */
void rtw_set_rpwm(struct adapter * adapt, u8 pslv)
{
	u8	rpwm;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);

	pslv = PS_STATE(pslv);

	if ((pwrpriv->rpwm == pslv) ||
	    (pwrpriv->lps_level == LPS_NORMAL))
		return;

	if (rtw_is_surprise_removed(adapt) ||
	    (!rtw_is_hw_init_completed(adapt))) {

		pwrpriv->cpwm = PS_STATE_S4;

		return;
	}

	if (rtw_is_drv_stopped(adapt))
		if (pslv < PS_STATE_S2)
			return;

	rpwm = pslv | pwrpriv->tog;

	pwrpriv->rpwm = pslv;

	rtw_hal_set_hwreg(adapt, HW_VAR_SET_RPWM, (u8 *)(&rpwm));

	pwrpriv->tog += 0x80;

	pwrpriv->cpwm = pslv;
}

static u8 PS_RDY_CHECK(struct adapter *adapt)
{
	u32 delta_ms;
	struct pwrctrl_priv	*pwrpriv = adapter_to_pwrctl(adapt);
	struct mlme_priv	*pmlmepriv = &(adapt->mlmepriv);

	if (pwrpriv->bInSuspend)
		return false;

	delta_ms = rtw_get_passing_time_ms(pwrpriv->DelayLPSLastTimeStamp);
	if (delta_ms < LPS_DELAY_MS)
		return false;

	if (check_fwstate(pmlmepriv, WIFI_SITE_MONITOR)
		|| check_fwstate(pmlmepriv, WIFI_UNDER_LINKING | WIFI_UNDER_WPS)
		|| MLME_IS_AP(adapt)
		|| MLME_IS_MESH(adapt)
		|| check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE | WIFI_ADHOC_STATE)
		|| rtw_cfg80211_get_is_roch(adapt)
		|| rtw_is_scan_deny(adapt))
		return false;

	if ((adapt->securitypriv.dot11AuthAlgrthm == dot11AuthAlgrthm_8021X) && (!adapt->securitypriv.binstallGrpkey)) {
		RTW_INFO("Group handshake still in progress !!!\n");
		return false;
	}

	if (!rtw_cfg80211_pwr_mgmt(adapt))
		return false;

