sebanc/brunch/external-drivers/rtl8723du/core/rtw_pwrctrl.c
	return true;
}

#if defined(CONFIG_FWLPS_IN_IPS)
void rtw_set_fw_in_ips_mode(struct adapter * adapt, u8 enable)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);
	int cnt = 0;
	unsigned long start_time;
	u8 val8 = 0;
	u8 cpwm_orig = 0, cpwm_now = 0;
	u8 parm[H2C_INACTIVE_PS_LEN] = {0};

	if (!adapt->netif_up) {
		RTW_INFO("%s: ERROR, netif is down\n", __func__);
		return;
	}

	/* u8 cmd_param; */ /* BIT0:enable, BIT1:NoConnect32k */
	if (enable) {
		rtw_btcoex_IpsNotify(adapt, pwrpriv->ips_mode_req);
		/* Enter IPS */
		RTW_INFO("%s: issue H2C to FW when entering IPS\n", __func__);

		parm[0] = 0x1;/* suggest by Isaac.Hsu*/

		rtw_hal_fill_h2c_cmd(adapt, /* H2C_FWLPS_IN_IPS_, */
				     H2C_INACTIVE_PS_,
				     H2C_INACTIVE_PS_LEN, parm);
		/* poll 0x1cc to make sure H2C command already finished by FW; MAC_0x1cc=0 means H2C done by FW. */
		do {
			val8 = rtw_read8(adapt, REG_HMETFR);
			cnt++;
			RTW_INFO("%s  polling REG_HMETFR=0x%x, cnt=%d\n",
				 __func__, val8, cnt);
			rtw_mdelay_os(10);
		} while (cnt < 100 && (val8 != 0));
	} else {
		/* Leave IPS */
		RTW_INFO("%s: Leaving IPS in FWLPS state\n", __func__);

		parm[0] = 0x0;
		parm[1] = 0x0;
		parm[2] = 0x0;
		rtw_hal_fill_h2c_cmd(adapt, H2C_INACTIVE_PS_,
				     H2C_INACTIVE_PS_LEN, parm);
		rtw_btcoex_IpsNotify(adapt, IPS_NONE);
	}
}
#endif

void rtw_set_ps_mode(struct adapter * adapt, u8 ps_mode, u8 smart_ps, u8 bcn_ant_mode, const char *msg)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapt);
	struct wifidirect_info	*pwdinfo = &(adapt->wdinfo);

	if (ps_mode > PM_Card_Disable) {
		return;
	}

	if (pwrpriv->pwr_mode == ps_mode) {
		if (PS_MODE_ACTIVE == ps_mode)
			return;
	}

#ifdef CONFIG_FW_MULTI_PORT_SUPPORT
	if (PS_MODE_ACTIVE != ps_mode) {
		rtw_set_ps_rsvd_page(adapt);
		rtw_set_default_port_id(adapt);
	}
#endif

	if (ps_mode == PS_MODE_ACTIVE) {
		if (1
		    && (((!rtw_btcoex_IsBtControlLps(adapt))
			 && (pwdinfo->opp_ps == 0))
			|| ((rtw_btcoex_IsBtControlLps(adapt))
			    && (!rtw_btcoex_IsLpsOn(adapt)))
		       )
		   ) {
			RTW_INFO(FUNC_ADPT_FMT" Leave 802.11 power save - %s\n",
				 FUNC_ADPT_ARG(adapt), msg);

			if (pwrpriv->lps_leave_cnts < UINT_MAX)
				pwrpriv->lps_leave_cnts++;
			else
				pwrpriv->lps_leave_cnts = 0;

			pwrpriv->pwr_mode = ps_mode;
			rtw_set_rpwm(adapt, PS_STATE_S4);

			rtw_hal_set_hwreg(adapt, HW_VAR_H2C_FW_PWRMODE, (u8 *)(&ps_mode));

			pwrpriv->bFwCurrentInPSMode = false;

			rtw_btcoex_LpsNotify(adapt, ps_mode);
		}
	} else {
		if ((PS_RDY_CHECK(adapt) && check_fwstate(&adapt->mlmepriv, WIFI_ASOC_STATE))
		    || ((rtw_btcoex_IsBtControlLps(adapt))
			&& (rtw_btcoex_IsLpsOn(adapt)))
		   ) {
			u8 pslv;

			RTW_INFO(FUNC_ADPT_FMT" Enter 802.11 power save - %s\n",
				 FUNC_ADPT_ARG(adapt), msg);

			if (pwrpriv->lps_enter_cnts < UINT_MAX)
				pwrpriv->lps_enter_cnts++;
			else
				pwrpriv->lps_enter_cnts = 0;
			rtw_btcoex_LpsNotify(adapt, ps_mode);

			pwrpriv->bFwCurrentInPSMode = true;
			pwrpriv->pwr_mode = ps_mode;
			pwrpriv->smart_ps = smart_ps;
			pwrpriv->bcn_ant_mode = bcn_ant_mode;

			rtw_hal_set_hwreg(adapt, HW_VAR_H2C_FW_PWRMODE, (u8 *)(&ps_mode));

			/* Set CTWindow after LPS */
			if (pwdinfo->opp_ps == 1)
				p2p_ps_wk_cmd(adapt, P2P_PS_ENABLE, 0);

			pslv = PS_STATE_S2;
			if ((!rtw_btcoex_IsBtDisabled(adapt))
			    && (rtw_btcoex_IsBtControlLps(adapt))) {
				u8 val8;

				val8 = rtw_btcoex_LpsVal(adapt);
				if (val8 & BIT(4))
					pslv = PS_STATE_S2;

			}
			rtw_set_rpwm(adapt, pslv);
		}
	}
}

/*
 * Return:
 *	0:	Leave OK
 *	-1:	Timeout
 *	-2:	Other error
 */
int LPS_RF_ON_check(struct adapter * adapt, u32 delay_ms)
{
	unsigned long start_time;
	u8 bAwake = false;
	int err = 0;


	start_time = rtw_get_current_time();
	while (1) {
		rtw_hal_get_hwreg(adapt, HW_VAR_FWLPS_RF_ON, &bAwake);
		if (bAwake)
			break;

		if (rtw_is_surprise_removed(adapt)) {
			err = -2;
			RTW_INFO("%s: device surprise removed!!\n", __func__);
			break;
		}

		if (rtw_get_passing_time_ms(start_time) > delay_ms) {
			err = -1;
			RTW_INFO("%s: Wait for FW LPS leave more than %u ms!!!\n", __func__, delay_ms);
			break;
		}
		rtw_usleep_os(100);
	}

	return err;
}

/*
 *	Description:
 *		Enter the leisure power save mode.
 *   */
void LPS_Enter(struct adapter * adapt, const char *msg)
{
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapt);
	struct pwrctrl_priv	*pwrpriv = dvobj_to_pwrctl(dvobj);
	int n_assoc_iface = 0;
	int i;
	char buf[32] = {0};


	/*	RTW_INFO("+LeisurePSEnter\n"); */
	if (!GET_HAL_DATA(adapt)->bFWReady)
		return;

	if (rtw_btcoex_IsBtControlLps(adapt))
		return;

	/* Skip lps enter request if number of assocated adapters is not 1 */
	for (i = 0; i < dvobj->iface_nums; i++) {
		if (check_fwstate(&(dvobj->adapters[i]->mlmepriv), WIFI_ASOC_STATE))
			n_assoc_iface++;
	}
	if (n_assoc_iface != 1)
		return;

#ifndef CONFIG_FW_MULTI_PORT_SUPPORT
	/* Skip lps enter request for adapter not port0 */
	if (get_hw_port(adapt) != HW_PORT0)
		return;
#endif

	for (i = 0; i < dvobj->iface_nums; i++) {
		if (!PS_RDY_CHECK(dvobj->adapters[i]))
			return;
	}

	if (adapt->wdinfo.p2p_ps_mode == P2P_PS_NOA) {
		return;/* supporting p2p client ps NOA via H2C_8723B_P2P_PS_OFFLOAD */
	}

	if (pwrpriv->bLeisurePs) {
		/* Idle for a while if we connect to AP a while ago. */
		if (pwrpriv->LpsIdleCount >= 2) { /* 4 Sec */
			if (pwrpriv->pwr_mode == PS_MODE_ACTIVE) {
				sprintf(buf, "WIFI-%s", msg);
				pwrpriv->bpower_saving = true;
				
				pwrpriv->pwr_saving_start_time = rtw_get_current_time();

				rtw_set_ps_mode(adapt, pwrpriv->power_mgnt, adapt->registrypriv.smart_ps, 0, buf);
			}
		} else {
			pwrpriv->LpsIdleCount++;
		}
	}
}

/*
 *	Description:
 *		Leave the leisure power save mode.
 *   */
void LPS_Leave(struct adapter * adapt, const char *msg)
{
#define LPS_LEAVE_TIMEOUT_MS 100

	struct dvobj_priv *dvobj = adapter_to_dvobj(adapt);
	struct pwrctrl_priv	*pwrpriv = dvobj_to_pwrctl(dvobj);
	char buf[32] = {0};

	if (rtw_btcoex_IsBtControlLps(adapt))
		return;

	if (pwrpriv->bLeisurePs) {
		if (pwrpriv->pwr_mode != PS_MODE_ACTIVE) {
			sprintf(buf, "WIFI-%s", msg);
			rtw_set_ps_mode(adapt, PS_MODE_ACTIVE, 0, 0, buf);

			pwrpriv->pwr_saving_time += rtw_get_passing_time_ms(pwrpriv->pwr_saving_start_time);

			if (pwrpriv->pwr_mode == PS_MODE_ACTIVE)
				LPS_RF_ON_check(adapt, LPS_LEAVE_TIMEOUT_MS);
		}
	}

